IF NOT EXISTS (SELECT * FROM [Groups])
BEGIN
	SET IDENTITY_INSERT [dbo].[Groups] ON;
	INSERT INTO Groups (GroupId, GroupName, GroupFacultyId, GroupNumStudents, GroupAvgScore) VALUES 
		(1,N'ФКіС-21',1,0,0),
		(2,N'ФКіС-22',1,0,0),
		(3,N'ФК-21',1,0,0),
		(4,N'ФК-31',1,0,0),
		(5,N'ФК-41',1,0,0),

		(6,N'ЕОС-21',2,0,0),
		(7,N'АГ-21',2,0,0),
		(8,N'АІ-21',2,0,0),
		(9,N'ЛГ-21',2,0,0),

		(10,N'ГРС-21',3,0,0),
		(11,N'ХТ-21',3,0,0),
		(12,N'ХТ-31',3,0,0),
		(13,N'ТЛП-31',3,0,0),
		(14,N'ХТ-41',3,0,0),

		(15,N'ІМ-21',4,0,0),
		(16,N'М-21',4,0,0),
		(17,N'М-31',4,0,0),
		(18,N'АТ-31',4,0,0),

		(19,N'ІПЗ-21',5,0,0),
		(20,N'ІПЗ-22',5,0,0),
		(21,N'ІПЗ-23',5,0,0),
		(22,N'ІПЗ-24',5,0,0),
		(23,N'КН-21',5,0,0),

		(24,N'МОм-11',6,0,0),
		(25,N'МКм-11',6,0,0),
		(26,N'ЕКм-21',6,0,0),
		(27,N'ОПм-21',6,0,0),
		(28,N'ФБСм-21',6,0,0),
		(29,N'ПУАм-21',6,0,0),
		(30,N'МО-31',6,0,0),
		(31,N'ПР-31',6,0,0),

		(32,N'Д-21',7,0,0),
		(33,N'Д-22',7,0,0),
		(34,N'Д-23',7,0,0),
		(35,N'Д-24',7,0,0);
	SET IDENTITY_INSERT [dbo].[Groups] OFF;
END