IF NOT EXISTS (SELECT * FROM [Faculties])
BEGIN
	SET IDENTITY_INSERT [dbo].[Faculties] ON;
	INSERT INTO Faculties (FacultyId, FacultyName, FacultyNotes) VALUES 
		(1,N'Факультет цифрових, освітніх та соціальних технологій',N'Декан: кандидат технічних наук, доцент
			Герасимчук Галина Андріївна
			Телефон: +38(0332)74-61-30, +38063 130 8578
			Е-mail: fdest@lntu.edu.ua'),
		(2,N'Факультет аграрних технологій та екології',N'Декан: кандидат технічних наук, професор
			Кірчук Руслан Васильович
			Телефон: +38 (0332) 74-61-08
			Е-mail: agro@lntu.edu.ua'),
		(3,N'Факультет митної справи, матеріалів та технологій',N'Декан: доктор технічних наук, професор
			Ткачук Валентина Віталіївна
			Телефон: +38 (0332) 74-61-47
			Е-mail: fmmt@lntu.edu.ua'),
		(4,N'Факультет транспорту та механічної інженерії',N'Декан: кандидат технічних наук, доцент
			Мурований Ігор Сергійович
			Телефон: +38 (0332) 74-61-31
			Е-mail:tmi@lntu.edu.ua'),
		(5,N'Факультет комп’ютерних та інформаційних технологій',N'Декан: кандидат економічних наук, доцент
			Кондіус Інна Степанівна
			Телефон: +38 (0332) 76-73-94
			Е-mail: knit@lntu.edu.ua'),
		(6,N'Факультет бізнесу та права',N'Декан: доктор економічних наук, професор
			Ковальська Любов Леонідівна
			Телефон: +38(0332)-74-61-48'),
		(7,N'Факультет архітектури, будівництва та дизайну',N'Декан: кандидат технічних наук, доцент
			Андрійчук Олександр Валентинович
			Телефон: +38 (0332) 26-17-10
			Е-mail: fabd@lntu.edu.ua');
	SET IDENTITY_INSERT [dbo].[Faculties] OFF;
END