IF NOT EXISTS (SELECT * FROM [Departments])
BEGIN
	SET IDENTITY_INSERT [dbo].[Departments] ON;
	INSERT INTO Departments (DepartmentId, DepartmentName, DepartmentFacultyId) VALUES 
		(1,N'Кафедра цифрових освітніх технологій',1),
		(2,N'Кафедра фізичної культури, спорту та здоров''я',1),
		(3,N'Кафедра соціогуманітарних технологій',1),
		(4,N'Кафедра іноземної та української філології',1),
		(5,N'Кафедра цивільної безпеки',1),

		(6,N'Кафедра агрономії',2),
		(7,N'Кафедра екології',2),
		(8,N'Кафедра аграрної інженерії
			імені професора Г. А. Хайліса',2),
		(9,N'Кафедра лісового господарства',2),

		(10,N'Кафедра товарознавства та експертизи в митній справі (ТЕМС)',3),
		(11,N'Кафедра матеріалознавства',3),
		(12,N'Кафедра технологій і обладнання переробних виробництв',3),
		(13,N'Кафедра технологій легкої промисловості',3),
		(14,N'Кафедра туризму та готельно-ресторанної справи',3),

		(15,N'Кафедра автомобілів і транспортних технологій',4),
		(16,N'Кафедра галузевого машинобудування',4),
		(17,N'Кафедра прикладної механіки та мехатроніки',4),
		(18,N'Кафедра фізики та вищої математики',4),

		(19,N'Кафедра комп''ютерної інженерії та кібербезпеки',5),
		(20,N'Кафедра інженерії програмного забезпечення',5),
		(21,N'Кафедра комп’ютерних наук',5),
		(22,N'Кафедра автоматизації та комп''ютерно-інтегрованих технологій',5),
		(23,N'Кафедра електроніки та телекомунікації',5),

		(24,N'Кафедра фінансів, банківської справи та страхування',6),
		(25,N'Кафедра підприємництва, торгівлі та логістики',6),
		(26,N'Кафедра менеджменту',6),
		(27,N'Кафедра міжнародних економічних відносин',6),
		(28,N'Кафедра маркетингу',6),
		(29,N'Кафедра права',6),
		(30,N'Кафедра економіки',6),
		(31,N'Кафедра обліку та аудиту',6),

		(32,N'Кафедра будівництва та цивільної інженерії',7),
		(33,N'Кафедра архітектури та дизайну',7),
		(34,N'Кафедра прикладної математики та механіки',7),
		(35,N'Кафедра електричної інженерії',7);
	SET IDENTITY_INSERT [dbo].[Departments] OFF;
END